#+TITLE: OTH Exporter Documentation Overview
#+OPTIONS: toc:nil

#+BEGIN_COMMENT
This file is the base from which to generate the Documentation.md file.

Its done like this, too keep all documentation source within the same document.

The readme can be generated by running:

org-export-dispatch->Export to Markdown -> To file

It can also be triggered from the shell by $ make documentation
#+END_COMMENT

#+begin_quote
This document is generated from =Documentation.org=.

Use the =documentation= Make target to generate it.
#+end_quote

* Exporter HTTP endpoints

The exporter has the following endpoints:
#+BEGIN_SRC http :pretty :exports both
GET http://localhost:8360
#+END_SRC

#+RESULTS:
#+begin_example
{
  "apiVersion": "1.2.0_build1",
  "environment": "prod",
  "links": {
    "measurement": "http://localhost:8360/measurement",
    "export": "http://localhost:8360/export",
    "failed": "http://localhost:8360/failed",
    "health": "http://localhost:8360/health",
    "status": "http://localhost:8360/status",
    "self": "http://localhost:8360/"
  }
}
#+end_example

The following methods/endpoints are supported by the exporter.

** The /health endpoint

The =/health= endpoint is used to access basic health information about the service. It only supports =HTTP GET=

The output is as follows:
#+BEGIN_SRC http :pretty :exports both
  GET http://localhost:8360/health
#+END_SRC

#+RESULTS:
: {
:   "apiVersion": "1.0.6_build1",
:   "environment": "dev"
: }

The health checks queries:
- database
- if kih export is selected:
  - Sosiserver for idcard signing
  - KIHDB for export
** The /export endpoint
The =/export= endpoint is used trigger the export. It only supports =HTTP GET=

When the export is started it does as follows:
1. Find time of last run
2. Get measurements from opentele from 30 minutes before time of lastrun
3. For each measurement:
   1. Check if measurement is already known and exported?
   2. Convert measurements to output format
   3. Export measurements
   4. Mark measurement as exported
4. Check if results was paginiation, if yes fetch next batch and perform steps in step 3
5. Mark run as completed

The output is as follows:
#+BEGIN_SRC restclient :pretty :exports both inline-body
GET http://localhost:8360/export
#+END_SRC

#+RESULTS:
#+begin_example
,#+BEGIN_SRC js
[
  {
    "Success": true,
    "Measurement": {
      "id": "d99394ab-2c51-440f-9aa1-4b97e62c8696",
      "measurement": "https://docker-demo.oth.io/clinician/api/patients/14/measurements/397",
      "patient": "https://docker-demo.oth.io/clinician/api/patients/14",
      "status": "COMPLETED",
      "created_at": "2020-02-25T15:58:40+01:00",
      "updated_at": "2020-02-25T15:58:41.361090851+01:00"
    }
  },
  {
    "Success": true,
    "Measurement": {
      "id": "883e39d0-ca2c-4995-9897-53c7b05528eb",
      "measurement": "https://docker-demo.oth.io/clinician/api/patients/13/measurements/396",
      "patient": "https://docker-demo.oth.io/clinician/api/patients/13",
      "status": "COMPLETED",
      "created_at": "2020-02-25T15:58:41+01:00",
      "updated_at": "2020-02-25T15:58:41.729067684+01:00"
    }
  },
]
// GET http://localhost:8360/export
// HTTP/1.1 200 OK
// Content-Type: application/json; charset=utf-8
,#+END_SRC
#+end_example

** The /status endpoint
The =/statuss= endpoint is used to access basic metrics from the underlying service. It only supports =HTTP GET=

The output is as follows:
#+BEGIN_SRC http :pretty :exports both
GET http://localhost:8360/status
#+END_SRC

#+RESULTS:
#+begin_example
{
  "Measurements": {
    "TotalMeasurements": 397,
    "TempFailedMeasurements": 0,
    "RejectedMeasurements": 5,
    "FailedMeasurements": 0
  },
  "LastRun": {
    "TimeStamp": "2020-02-25T16:14:18+01:00",
    "Status": "COMPLETED"
  },
  "Runs": {
    "Total": 2,
    "Failed": 0,
    "Successfull": 2
  },
  "Source": {
    "Endpoint": "https://docker-demo.oth.io/clinician/api"
  },
  "Destination": {
    "Endpoint": "https://kihdb-devel.oth.io/services/monitoringDataset"
  }
}
#+end_example

** The /measurement endpoint

The =/measurement/ endpoint is used to retrieve a measurement using the ID for the measurement. The operations fetches both the exporters internal state, as well as the actual measurement and patient from OTH.

Example:
#+BEGIN_SRC http :pretty :exports both
GET localhost:8360/measurement/7ee1c80c-d687-4c02-9ac4-8a9bc8586111
#+END_SRC

#+RESULTS:
#+begin_example
{
  "patient": {
    "createdDate": "2021-06-25T07:06:37.000Z",
    "uniqueId": "2512688916",
    "username": "Lisa",
    "firstName": "Lisa",
    "lastName": "Jensen",
    "dateOfBirth": null,
    "sex": "female",
    "status": "active",
    "address": "21 Carter Building Washington",
    "postalCode": "DC 20510",
    "city": "Washington DC",
    "place": null,
    "phone": null,
    "mobilePhone": "",
    "email": "",
    "comment": null,
    "patientGroups": [
      {
        "name": "Obstructive Lung Disease Clinic",
        "links": {
          "patientGroup": "https://docker-demo.oth.io/clinician/api/patientgroups/4"
        }
      }
    ],
    "relatives": [],
    "links": {
      "self": "https://docker-demo.oth.io/clinician/api/patients/14",
      "questionnaireSchedules": "https://docker-demo.oth.io/clinician/api/patients/14/questionnaire_schedules",
      "measurements": "https://docker-demo.oth.io/clinician/api/patients/14/measurement-types",
      "questionnaireResults": "https://docker-demo.oth.io/clinician/api/patients/14/questionnaire-results",
      "patientThresholds": ""
    }
  },
  "measurement": {
    "timestamp": "2021-06-02T09:00:00+02:00",
    "type": "bloodsugar",
    "measurement": {
      "unit": "mmol/L",
      "value": 6.900000095367432,
      "ignored": {
        "by": {
          "firstName": "",
          "lastName": "",
          "email": "",
          "links": {}
        }
      }
    },
    "origin": {
      "manualMeasurement": {
        "enteredBy": ""
      },
      "deviceMeasurement": {
        "connectionType": "bluetooth_spp",
        "manufacturer": "MyGlycoHealth",
        "model": "MyGlycoHealth",
        "primaryDeviceIdentifier": {
          "macAddress": "AA:BB:CC:DD:EE:FF"
        },
        "hardwareVersion": "A2",
        "firmwareVersion": "Z3",
        "softwareVersion": "B1",
        "additionalDeviceIdentifiers": [
          {
            "systemId": "123456",
            "other": {
              "description": "",
              "value": ""
            }
          },
          {
            "other": {
              "description": "manufacturer_id",
              "value": "ACF123G155"
            }
          }
        ]
      }
    },
    "links": {
      "patient": "https://docker-demo.oth.io/clinician/api/patients/14"
    }
  },
  "storedMeasurement": {
    "id": "7ee1c80c-d687-4c02-9ac4-8a9bc8586111",
    "measurement": "https://docker-demo.oth.io/clinician/api/patients/14/measurements/279",
    "patient": "https://docker-demo.oth.io/clinician/api/patients/14",
    "status": "COMPLETED",
    "created_at": "2021-05-21T13:58:15+02:00",
    "updated_at": "2021-05-21T13:58:16+02:00"
  }
}
#+end_example

